# AssemblyPrecastFreeze Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AssemblyPrecastFreeze Property
ParameterTypeId Class See Also
---
"Disable Precast Updates"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AssemblyPrecastFreeze { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyPrecastFreeze As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AssemblyPrecastFreeze {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace